
//16.12.23 Добавление в форму новых реквизитов в зависиости от Выбора в Виде договоров "Абонентское обслуживание" 

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
    
    ОпределитьВидимостьЭлементов(); 
    
КонецПроцедуры  

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)  
    
    ОпределитьВидимостьЭлементов(); 
    
КонецПроцедуры  

&НаСервере
Процедура ОпределитьВидимостьЭлементов()
    
    Если  Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание")Тогда
        
        Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина; 
        Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина; 
        Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = Истина; 
        Элементы.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты.Видимость = Истина; 
    Иначе
        Объект.ВКМ_ДатаНачалаДействияДоговора = Неопределено; 
        Объект.ВКМ_ДатаОкончанияДействияДоговора = Неопределено; 
        Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста = Неопределено; 
        Объект.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты = Неопределено; 
        Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь;  
        Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь; 
        Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = Ложь; 
        Элементы.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты.Видимость = Ложь; 
    КонецЕсли; 
    
КонецПроцедуры

//16.12.23 Конец добавления    

 

