#language: ru

@tree

Функционал: Создание трех обслуживаний на специалистов от имени Менеджера

Как тестировщик я хочу
показать процесс создания простого сценария тестирования 
чтобы разобрать процесс созданий обслуживаний    

Сценарий: Создание трех обслуживаний на специалистов от имени Менеджера
		  И я подключаю TestClient "DiplomУправлениеITФирмой" логин "ВасилийМ" пароль ""
		* И я выбираю в "Добавленные объекты" - "Обслуживание клиента"
			И В командном интерфейсе я выбираю 'Добавленные объекты' 'Обслуживание клиента'
			Тогда открылось окно 'Обслуживание клиента'
		* И я создаю первый документ
			И я нажимаю на кнопку с именем 'ФормаСоздать'
			Тогда открылось окно 'Обслуживание клиента (создание)'
			И из выпадающего списка с именем "Клиент" я выбираю точное значение 'ООО "Тулаточмаш"'
			И я нажимаю кнопку выбора у поля с именем "Договор"
			Тогда открылось окно 'Договоры контрагентов'
			И в таблице "Список" я перехожу к строке:
				| 'Код'       | 'Наименование' |
				| '000000001' | 'Основной'     |
			И в таблице "Список" я выбираю текущую строку
			Тогда открылось окно 'Обслуживание клиента (создание) *'
			И из выпадающего списка с именем "Специалист" я выбираю точное значение 'Владимир'
			И я нажимаю кнопку выбора у поля с именем "ДатаПроведенияРабот"
			И в поле с именем 'ДатаПроведенияРабот' я ввожу текст '20.03.2024'
			И в поле с именем 'ВремяНачалаРабот' я ввожу текст ' 9:00:00'
			И я перехожу к следующему реквизиту
			И в поле с именем 'ВремяОкончанияРабот' я ввожу текст '11:00:00'
			И я перехожу к следующему реквизиту
			И в поле с именем 'ОписаниеПроблемы' я ввожу текст 'Диагностика'
			И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
			И я жду закрытия окна 'Обслуживание клиента (создание) *' в течение 20 секунд
		Тогда открылось окно 'Обслуживание клиента'
		* И я создаю второй документ
			И я нажимаю на кнопку с именем 'ФормаСоздать'
			Тогда открылось окно 'Обслуживание клиента (создание)'
			И из выпадающего списка с именем "Клиент" я выбираю точное значение 'АО "Радиант"'
			И я нажимаю кнопку выбора у поля с именем "Договор"
			Тогда открылось окно 'Договоры контрагентов'
            И в таблице "Список" я перехожу к строке:
				| 'Код'       | 'Наименование' |
				| '000000006' | '180324'     |
			И в таблице "Список" я выбираю текущую строку
			Тогда открылось окно 'Обслуживание клиента (создание) *'
			И из выпадающего списка с именем "Специалист" я выбираю точное значение 'Петр'
			И я нажимаю кнопку выбора у поля с именем "ДатаПроведенияРабот"
			И в поле с именем 'ДатаПроведенияРабот' я ввожу текст '20.03.2024'
			И в поле с именем 'ВремяНачалаРабот' я ввожу текст ' 9:30:00'
			И я перехожу к следующему реквизиту
			И в поле с именем 'ВремяОкончанияРабот' я ввожу текст '11:30:00'
			И в поле с именем 'ОписаниеПроблемы' я ввожу текст 'Решение проблемы'
			И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
			И я жду закрытия окна 'Обслуживание клиента (создание) *' в течение 20 секунд
		Тогда открылось окно 'Обслуживание клиента'
		* И я создаю третий документ
			И я нажимаю на кнопку с именем 'ФормаСоздать'
			Тогда открылось окно 'Обслуживание клиента (создание)'
			И из выпадающего списка с именем "Клиент" я выбираю точное значение 'ООО "ВИТАЛ"'
			И я нажимаю кнопку выбора у поля с именем "Договор"
			Тогда открылось окно 'Договоры контрагентов'
            И в таблице "Список" я перехожу к строке:
				| 'Код'       | 'Наименование' |
				| '000000007' | 'Виталовский'     |
			И в таблице "Список" я выбираю текущую строку
			Тогда открылось окно 'Обслуживание клиента (создание) *'
			И из выпадающего списка с именем "Специалист" я выбираю точное значение 'Дима'
			И я нажимаю кнопку выбора у поля с именем "ДатаПроведенияРабот"
			И в поле с именем 'ДатаПроведенияРабот' я ввожу текст '21.03.2024'
			И в поле с именем 'ВремяНачалаРабот' я ввожу текст ' 9:00:00'
			И я перехожу к следующему реквизиту
			И в поле с именем 'ВремяОкончанияРабот' я ввожу текст '10:00:00'
			И я перехожу к следующему реквизиту
			И в поле с именем 'ОписаниеПроблемы' я ввожу текст 'Знакомство'
			И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
			И я жду закрытия окна 'Обслуживание клиента (создание) *' в течение 20 секунд
		* И я проверяю наличие новых строк в "Обслуживание клиента"
			И таблица "Список" содержит строки: 
				| 'Клиент'           | 'Договор'    |'Специалист'|'Начало' |'Окончание'|'Описание проблемы'|
				| 'ООО "Тулаточмаш"' | 'Основной'   |'Владимир'  |'9:00:00'|'11:00:00 '|'Диагностика'      |
				| 'АО "Радиант"'     | '180324'     |'Петр'      |'9:30:00'|'11:30:00 '|'Решение проблемы' |
				| 'ООО "ВИТАЛ"'      | 'Виталовский'|'Дима'      |'9:00:00'|'10:00:00 '|'Знакомство'       |
